app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.all.order(created_at: :DESC)

INSERT INTO "articles" ("title", "content", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Milano Design week"], ["content", ""], ["slug", "milano-design-week"], ["created_at", "2016-04-08 18:30:05.511911"], ["updated_at", "2016-04-08 18:30:05.511911"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_article
      @article = Article.friendly.find(params[:id])