app/controllers/home_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC
SELECT "projects".* FROM "projects"  ORDER BY "projects"."created_at" DESC
---
  def index
    @articles = Article.all.order(created_at: :DESC)
    @projects = Project.all.order(created_at: :DESC)