app/controllers/projects_controller.rb

  def index
    @projects = Project.all.all.order(created_at: :DESC)
---
SELECT "projects".* FROM "projects"  ORDER BY "projects"."created_at" DESC

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("title", "content", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["image_updated_at", "2016-04-09 19:16:46.153159"], ["image_file_name", "IMG_0761.JPG"], ["updated_at", "2016-04-09 19:16:47.734418"], ["id", 2]]